###################################################################

# Created by write_sdc on Thu Jan 13 11:19:06 2022

###################################################################

set_load -pin_load 0.1 [get_ports {z[7]}]
set_load -pin_load 0.1 [get_ports {z[6]}]
set_load -pin_load 0.1 [get_ports {z[5]}]
set_load -pin_load 0.1 [get_ports {z[4]}]
set_load -pin_load 0.1 [get_ports {z[3]}]
set_load -pin_load 0.1 [get_ports {z[2]}]
set_load -pin_load 0.1 [get_ports {z[1]}]
set_load -pin_load 0.1 [get_ports {z[0]}]
set_load -pin_load 0.1 [get_ports done]
set_max_capacitance 1.5 [get_ports {z[7]}]
set_max_capacitance 1.5 [get_ports {z[6]}]
set_max_capacitance 1.5 [get_ports {z[5]}]
set_max_capacitance 1.5 [get_ports {z[4]}]
set_max_capacitance 1.5 [get_ports {z[3]}]
set_max_capacitance 1.5 [get_ports {z[2]}]
set_max_capacitance 1.5 [get_ports {z[1]}]
set_max_capacitance 1.5 [get_ports {z[0]}]
set_max_capacitance 1.5 [get_ports done]
set_max_transition 1.5 [get_ports {a[7]}]
set_max_transition 1.5 [get_ports {a[6]}]
set_max_transition 1.5 [get_ports {a[5]}]
set_max_transition 1.5 [get_ports {a[4]}]
set_max_transition 1.5 [get_ports {a[3]}]
set_max_transition 1.5 [get_ports {a[2]}]
set_max_transition 1.5 [get_ports {a[1]}]
set_max_transition 1.5 [get_ports {a[0]}]
set_max_transition 1.5 [get_ports {b[7]}]
set_max_transition 1.5 [get_ports {b[6]}]
set_max_transition 1.5 [get_ports {b[5]}]
set_max_transition 1.5 [get_ports {b[4]}]
set_max_transition 1.5 [get_ports {b[3]}]
set_max_transition 1.5 [get_ports {b[2]}]
set_max_transition 1.5 [get_ports {b[1]}]
set_max_transition 1.5 [get_ports {b[0]}]
set_max_transition 1.5 [get_ports clock]
set_max_transition 1.5 [get_ports reset]
set_max_transition 1.5 [get_ports start]
create_clock [get_ports clock]  -period 100  -waveform {0 50}
set_clock_latency 0.1  [get_clocks clock]
set_clock_uncertainty 0.1  [get_clocks clock]
set_clock_transition -max -rise 0.1 [get_clocks clock]
set_clock_transition -max -fall 0.1 [get_clocks clock]
set_clock_transition -min -rise 0.1 [get_clocks clock]
set_clock_transition -min -fall 0.1 [get_clocks clock]
group_path -name FEEDTHROUGH  -from [list [get_ports {a[7]}] [get_ports {a[6]}] [get_ports {a[5]}] [get_ports {a[4]}] [get_ports {a[3]}] [get_ports {a[2]}] [get_ports {a[1]}] [get_ports {a[0]}] [get_ports {b[7]}] [get_ports {b[6]}] [get_ports {b[5]}] [get_ports {b[4]}] [get_ports {b[3]}] [get_ports {b[2]}] [get_ports {b[1]}] [get_ports {b[0]}] [get_ports reset] [get_ports start]]  -to [list [get_ports {z[7]}] [get_ports {z[6]}] [get_ports {z[5]}] [get_ports {z[4]}] [get_ports {z[3]}] [get_ports {z[2]}] [get_ports {z[1]}] [get_ports {z[0]}] [get_ports done]]
group_path -name REGIN  -from [list [get_ports {a[7]}] [get_ports {a[6]}] [get_ports {a[5]}] [get_ports {a[4]}] [get_ports {a[3]}] [get_ports {a[2]}] [get_ports {a[1]}] [get_ports {a[0]}] [get_ports {b[7]}] [get_ports {b[6]}] [get_ports {b[5]}] [get_ports {b[4]}] [get_ports {b[3]}] [get_ports {b[2]}] [get_ports {b[1]}] [get_ports {b[0]}] [get_ports reset] [get_ports start]]
group_path -name REGOUT  -to [list [get_ports {z[7]}] [get_ports {z[6]}] [get_ports {z[5]}] [get_ports {z[4]}] [get_ports {z[3]}] [get_ports {z[2]}] [get_ports {z[1]}] [get_ports {z[0]}] [get_ports done]]
set_input_delay -clock clock  1.2  [get_ports clock]
set_input_delay -clock clock  1.2  [get_ports {a[7]}]
set_input_delay -clock clock  1.2  [get_ports {a[6]}]
set_input_delay -clock clock  1.2  [get_ports {a[5]}]
set_input_delay -clock clock  1.2  [get_ports {a[4]}]
set_input_delay -clock clock  1.2  [get_ports {a[3]}]
set_input_delay -clock clock  1.2  [get_ports {a[2]}]
set_input_delay -clock clock  1.2  [get_ports {a[1]}]
set_input_delay -clock clock  1.2  [get_ports {a[0]}]
set_input_delay -clock clock  1.2  [get_ports {b[7]}]
set_input_delay -clock clock  1.2  [get_ports {b[6]}]
set_input_delay -clock clock  1.2  [get_ports {b[5]}]
set_input_delay -clock clock  1.2  [get_ports {b[4]}]
set_input_delay -clock clock  1.2  [get_ports {b[3]}]
set_input_delay -clock clock  1.2  [get_ports {b[2]}]
set_input_delay -clock clock  1.2  [get_ports {b[1]}]
set_input_delay -clock clock  1.2  [get_ports {b[0]}]
set_input_delay -clock clock  1.2  [get_ports reset]
set_input_delay -clock clock  1.2  [get_ports start]
set_output_delay -clock clock  1.2  [get_ports {z[7]}]
set_output_delay -clock clock  1.2  [get_ports {z[6]}]
set_output_delay -clock clock  1.2  [get_ports {z[5]}]
set_output_delay -clock clock  1.2  [get_ports {z[4]}]
set_output_delay -clock clock  1.2  [get_ports {z[3]}]
set_output_delay -clock clock  1.2  [get_ports {z[2]}]
set_output_delay -clock clock  1.2  [get_ports {z[1]}]
set_output_delay -clock clock  1.2  [get_ports {z[0]}]
set_output_delay -clock clock  1.2  [get_ports done]
