
                                 PrimeTime (R)

               Version M-2017.06-SP2 for linux64 - Aug 25, 2017 

                    Copyright (c) 1988 - 2017 Synopsys, Inc.
   This software and the associated documentation are proprietary to Synopsys,
 Inc. This software may only be used in accordance with the terms and conditions
 of a written license agreement with Synopsys, Inc. All other use, reproduction,
            or distribution of this software is strictly prohibited.

#################################################################################
# PrimeTime Reference Methodology Script
# Script: pt.tcl
# Version: K-2015.06 (July 13, 2015)
# Copyright (C) 2008-2015 Synopsys All rights reserved.
################################################################################
# Please do not modify the sdir variable.
# Doing so may cause script to fail.
set PROJECT_DIR                   $env(PROJECT_DIR)  ;# root path of the project
/home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier
# all the synthesis scripts are in ${PROJECT_DIR)/ptpx
set sdir "${PROJECT_DIR}/ptpx"
/home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier/ptpx
##################################################################
#    Source common and pt_setup.tcl File                         #
##################################################################
source ${sdir}/rm_setup/common_setup.tcl
RM-Info: Running script /home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier/ptpx/rm_setup/common_setup.tcl

RM-Info: Running script /home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier/common/rm_setup/common_setup.tcl

RM-Info: Completed script /home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier/common/rm_setup/common_setup.tcl

source ${sdir}/rm_setup/pt_setup.tcl
RM-Info: Running script /home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier/ptpx/rm_setup/pt_setup.tcl

Error: can't read "DESIGN_SAIF_FILE": no such variable
	Use error_info for more info. (CMD-013)
Information: script '/home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier/ptpx/rm_setup/pt_setup.tcl'
	stopped at line 47 due to error. (CMD-081)
Information: script '/home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier/ptpx/rm_pt_scripts/pt.tcl'
	stopped at line 23 due to error. (CMD-081)
Information: Defining new variable 'DESIGN_SDF_FILE'. (CMD-041)
Information: Defining new variable 'LIBRARY_DONT_USE_FILE'. (CMD-041)
Information: Defining new variable 'ADDITIONAL_SEARCH_PATH'. (CMD-041)
Information: Defining new variable 'DESIGN_NETLIST'. (CMD-041)
Information: Defining new variable 'MAP_FILE'. (CMD-041)
Information: Defining new variable 'REPORTS_DIR'. (CMD-041)
Information: Defining new variable 'TECH_FILE'. (CMD-041)
Information: Defining new variable 'VA3_COORDINATES'. (CMD-041)
Information: Defining new variable 'MW_POWER_NET1'. (CMD-041)
Information: Defining new variable 'MW_POWER_NET2'. (CMD-041)
Information: Defining new variable 'MW_POWER_NET3'. (CMD-041)
Information: Defining new variable 'HIERARCHICAL_CELLS'. (CMD-041)
Information: Defining new variable 'MW_POWER_NET4'. (CMD-041)
Information: Defining new variable 'MIN_LIBRARY_FILES'. (CMD-041)
Information: Defining new variable 'DESIGN_VCD_FILE'. (CMD-041)
Information: Defining new variable 'DESIGN_CONSTRAINT_FILE'. (CMD-041)
Information: Defining new variable 'VA4_COORDINATES'. (CMD-041)
Information: Defining new variable 'MIN_ROUTING_LAYER'. (CMD-041)
Information: Defining new variable 'MW_REFERENCE_LIB_DIRS'. (CMD-041)
Information: Defining new variable 'SYN_DIR'. (CMD-041)
Information: Defining new variable 'ADDITIONAL_LINK_LIB_FILES'. (CMD-041)
Information: Defining new variable 'TLUPLUS_MAX_FILE'. (CMD-041)
Information: Defining new variable 'TARGET_LIBRARY_FILES'. (CMD-041)
Information: Defining new variable 'DESIGN_NAME'. (CMD-041)
Information: Defining new variable 'PROJECT_DIR'. (CMD-041)
Information: Defining new variable 'DESIGN_REF_DATA_PATH'. (CMD-041)
Information: Defining new variable 'STD_LIBRARY_SUFFIX'. (CMD-041)
Information: Defining new variable 'NETLIST_FILES'. (CMD-041)
Information: Defining new variable 'VA1_COORDINATES'. (CMD-041)
Information: Defining new variable 'DESIGN_INSTANCE_PATH'. (CMD-041)
Information: Defining new variable 'TLUPLUS_MIN_FILE'. (CMD-041)
Information: Defining new variable 'sdir'. (CMD-041)
Information: Defining new variable 'DESIGN_KIT_PATH'. (CMD-041)
Information: Defining new variable 'RESULTS_DIR'. (CMD-041)
Information: Defining new variable 'STD_LIBRARY_TYPE'. (CMD-041)
Information: Defining new variable 'MAX_ROUTING_LAYER'. (CMD-041)
Information: Defining new variable 'MW_REFERENCE_CONTROL_FILE'. (CMD-041)
Information: Defining new variable 'HIERARCHICAL_DESIGNS'. (CMD-041)
Information: Defining new variable 'VA2_COORDINATES'. (CMD-041)
Information: Defining new variable 'PD1'. (CMD-041)
Information: Defining new variable 'PD2'. (CMD-041)
Information: Defining new variable 'PD3'. (CMD-041)
Information: Defining new variable 'PD4'. (CMD-041)
pt_shell> e[Kset PROJECT_DIR                   $env(PROJECT_DIR)
/home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier
pt_shell> set sdir "${PROJECT_DIR}/ptpx"
/home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier/ptpx
pt_shell> source ${sdir}/rm_setup/common_setup.tcl
RM-Info: Running script /home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier/ptpx/rm_setup/common_setup.tcl

RM-Info: Running script /home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier/common/rm_setup/common_setup.tcl

RM-Info: Completed script /home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier/common/rm_setup/common_setup.tcl

pt_shell> source ${sdir}/rm_setup/pt_setup.tcl
RM-Info: Running script /home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier/ptpx/rm_setup/pt_setup.tcl

Error: can't read "DESIGN_SAIF_FILE": no such variable
	Use error_info for more info. (CMD-013)
Information: script '/home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier/ptpx/rm_setup/pt_setup.tcl'
	stopped at line 47 due to error. (CMD-081)
pt_shell> e[Ksource ${sdir}/rm_setup/pt_setup.tcl
RM-Info: Running script /home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier/ptpx/rm_setup/pt_setup.tcl

Error: can't read "DESIGN_SAIF_FILE": no such variable
	Use error_info for more info. (CMD-013)
Information: script '/home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier/ptpx/rm_setup/pt_setup.tcl'
	stopped at line 47 due to error. (CMD-081)
pt_shell> source ${sdir}/rm_setup/pt_setup.tcl[35G[4@common[51G
RM-Info: Running script /home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier/ptpx/rm_setup/common_setup.tcl

RM-Info: Running script /home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier/common/rm_setup/common_setup.tcl

RM-Info: Completed script /home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier/common/rm_setup/common_setup.tcl

Information: Defining new variable 'DESIGN_SAIF_FILE'. (CMD-041)
pt_shell> source ${sdir}/rm_setup/common_setup.tcl[35G[4Ppt[47G
RM-Info: Running script /home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier/ptpx/rm_setup/pt_setup.tcl

RM-Info: Completed script /home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier/ptpx/rm_setup/pt_setup.tcl

Information: Defining new variable 'ACTIVITY_FILE'. (CMD-041)
Information: Defining new variable 'SDF_FILES'. (CMD-041)
Information: Defining new variable 'CONSTRAINT_FILES'. (CMD-041)
Information: Defining new variable 'STRIP_PATH'. (CMD-041)
Information: Defining new variable 'SDF_PATHS'. (CMD-041)
Information: Defining new variable 'NAME_MAP_FILE'. (CMD-041)
pt_shell> set REPORTS_DIR ${sdir}/reports 
/home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier/ptpx/reports
pt_shell> file mkdir ${REPORTS_DIR}
pt_shell> 
pt_shell> set RESULTS_DIR ${sdir}/results
/home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier/ptpx/results
pt_shell> file mkdir ${RESULTS_DIR}
pt_shell> 
pt_shell> 
pt_shell> 
pt_shell> ##################################################################
pt_shell> #    Search Path, Library and Operating Condition Section        #
pt_shell> ##################################################################
pt_shell> 
pt_shell> # Under normal circumstances, when executing a script with source, Tcl
pt_shell> # errors (syntax and semantic) cause the execution of the script to terminate.
pt_shell> # Uncomment the following line to set sh_continue_on_error to true to allow 
pt_shell> # processing to continue when errors occur.
pt_shell> #set sh_continue_on_error true 
pt_shell> 
pt_shell> 
pt_shell>   
pt_shell> set power_enable_analysis true 
true
pt_shell> set power_enable_multi_rail_analysis true 
true
pt_shell> set power_analysis_mode time_based 
time_based
pt_shell> 
pt_shell> set report_default_significant_digits 3 ;
3
pt_shell> set sh_source_uses_search_path true ;
true
pt_shell> set search_path ". $search_path" ;
. . /home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier/syn/input
                                   /home/dkits/FreePDK45/NangateOpenCellLibrary_PDKv1_3_v2010_12/Front_End/db/NLDM . /home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier/syn/input
                                   /home/dkits/FreePDK45/NangateOpenCellLibrary_PDKv1_3_v2010_12/Front_End/db/NLDM . /home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier/syn/input
                                   /home/dkits/FreePDK45/NangateOpenCellLibrary_PDKv1_3_v2010_12/Front_End/db/NLDM . /home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier/syn/input
                                   /home/dkits/FreePDK45/NangateOpenCellLibrary_PDKv1_3_v2010_12/Front_End/db/NLDM 
pt_shell> 
pt_shell> ##################################################################
pt_shell> #    Netlist Reading Section                                     #
pt_shell> ##################################################################
pt_shell> set link_path "* $link_path"
* * NangateOpenCellLibrary_typical.db 
pt_shell> read_verilog ${DESIGN_NETLIST}
1
pt_shell> 
pt_shell> current_design $DESIGN_NAME 
Information: current_design won't return any data before link (DES-071)
pt_shell> link
Loading verilog file '/home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier/syn/results/montgomery_multiplier.mapped.v'
Loading db file '/home/dkits/FreePDK45/NangateOpenCellLibrary_PDKv1_3_v2010_12/Front_End/db/NLDM/NangateOpenCellLibrary_typical.db'
Linking design montgomery_multiplier...
Information: Removing 3 unneeded designs..... (LNK-034)
Information: 119 (88.81%) library cells are unused in library NangateOpenCellLibrary..... (LNK-045)
Information: total 119 library cells are unused (LNK-046)
Design 'montgomery_multiplier' was successfully linked.
Information: There are 109 leaf cells, ports, hiers and 113 nets in the design (LNK-047)
1
pt_shell> 
pt_shell> 
pt_shell> ##################################################################
pt_shell> #    Back Annotation Section                                     #
pt_shell> ##################################################################
pt_shell> if { [info exists SDF_PATHS] && [info exists SDF_FILES] } {
? [K[11G? foreach sdf_path $SDF_PATHS sdf_file $SDF_FILES {
? [K[11G?    if {[string compare $sdf_path $DESIGN_NAME] == 0} {
? [K[11G?       read_sdf -analysis_type on_chip_variation $sdf_file
? [K[11G?    } else {
? [K[11G?       read_sdf -path $sdf_path -analysis_type on_chip_variation $sdf_file
? [K[11G?    }
? [K[11G? }
? [K[11G? report_annotated_delay > $REPORTS_DIR/${DESIGN_NAME}_report_annotated_delay.report
? [K[11G? }

****************************************
Report : read_sdf /home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier/syn/results/montgomery_multiplier.mapped.sdf
	-load_delay cell
	-analysis_type on_chip_variation
	-min_type sdf_min
	-max_type sdf_max
Design : montgomery_multiplier
Version: M-2017.06-SP2
Date   : Thu Jan 13 12:57:46 2022
****************************************

        0 error(s)
        Number of annotated cell delay arcs :       496
        Number of annotated net delay arcs  :       203
        Number of annotated timing checks   :       192
        TEMPERATURE: 25.00 (min)  25.00 (max)
        VOLTAGE    : 1.10 (min)  1.10 (max)
        PROCESS    : typical (min)  typical (max)
Information: Defining new variable 'sdf_path'. (CMD-041)
Information: Defining new variable 'sdf_file'. (CMD-041)
pt_shell> 
pt_shell> 
pt_shell> 
pt_shell> ##################################################################
pt_shell> #    Reading Constraints Section                                 #
pt_shell> ##################################################################
pt_shell> if  {[info exists CONSTRAINT_FILES]} {
? [K[11G?         foreach constraint_file $CONSTRAINT_FILES {
? [K[11G?                 if {[file extension $constraint_file] eq ".sdc"} {
? [K[11G?                         read_sdc -echo $constraint_file
? [K[11G?                 } else {
? [K[11G?                         source -echo $constraint_file
? [K[11G?                 }
? [K[11G?         }
? [K[11G? }

Reading SDC version 2.0...
###################################################################
# Created by write_sdc on Thu Jan 13 11:19:06 2022
###################################################################
set_load -pin_load 0.1 [get_ports {z[7]}]
set_load -pin_load 0.1 [get_ports {z[6]}]
set_load -pin_load 0.1 [get_ports {z[5]}]
set_load -pin_load 0.1 [get_ports {z[4]}]
set_load -pin_load 0.1 [get_ports {z[3]}]
set_load -pin_load 0.1 [get_ports {z[2]}]
set_load -pin_load 0.1 [get_ports {z[1]}]
set_load -pin_load 0.1 [get_ports {z[0]}]
set_load -pin_load 0.1 [get_ports done]
set_max_capacitance 1.5 [get_ports {z[7]}]
set_max_capacitance 1.5 [get_ports {z[6]}]
set_max_capacitance 1.5 [get_ports {z[5]}]
set_max_capacitance 1.5 [get_ports {z[4]}]
set_max_capacitance 1.5 [get_ports {z[3]}]
set_max_capacitance 1.5 [get_ports {z[2]}]
set_max_capacitance 1.5 [get_ports {z[1]}]
set_max_capacitance 1.5 [get_ports {z[0]}]
set_max_capacitance 1.5 [get_ports done]
set_max_transition 1.5 [get_ports {a[7]}]
set_max_transition 1.5 [get_ports {a[6]}]
set_max_transition 1.5 [get_ports {a[5]}]
set_max_transition 1.5 [get_ports {a[4]}]
set_max_transition 1.5 [get_ports {a[3]}]
set_max_transition 1.5 [get_ports {a[2]}]
set_max_transition 1.5 [get_ports {a[1]}]
set_max_transition 1.5 [get_ports {a[0]}]
set_max_transition 1.5 [get_ports {b[7]}]
set_max_transition 1.5 [get_ports {b[6]}]
set_max_transition 1.5 [get_ports {b[5]}]
set_max_transition 1.5 [get_ports {b[4]}]
set_max_transition 1.5 [get_ports {b[3]}]
set_max_transition 1.5 [get_ports {b[2]}]
set_max_transition 1.5 [get_ports {b[1]}]
set_max_transition 1.5 [get_ports {b[0]}]
set_max_transition 1.5 [get_ports clock]
set_max_transition 1.5 [get_ports reset]
set_max_transition 1.5 [get_ports start]
create_clock [get_ports clock]  -period 100  -waveform {0 50}
set_clock_latency 0.1  [get_clocks clock]
set_clock_uncertainty 0.1  [get_clocks clock]
set_clock_transition -max -rise 0.1 [get_clocks clock]
set_clock_transition -max -fall 0.1 [get_clocks clock]
set_clock_transition -min -rise 0.1 [get_clocks clock]
set_clock_transition -min -fall 0.1 [get_clocks clock]
group_path -name FEEDTHROUGH  -from [list [get_ports {a[7]}] [get_ports {a[6]}] [get_ports {a[5]}] [get_ports {a[4]}] [get_ports {a[3]}] [get_ports {a[2]}] [get_ports {a[1]}] [get_ports {a[0]}] [get_ports {b[7]}] [get_ports {b[6]}] [get_ports {b[5]}] [get_ports {b[4]}] [get_ports {b[3]}] [get_ports {b[2]}] [get_ports {b[1]}] [get_ports {b[0]}] [get_ports reset] [get_ports start]]  -to [list [get_ports {z[7]}] [get_ports {z[6]}] [get_ports {z[5]}] [get_ports {z[4]}] [get_ports {z[3]}] [get_ports {z[2]}] [get_ports {z[1]}] [get_ports {z[0]}] [get_ports done]]
group_path -name REGIN  -from [list [get_ports {a[7]}] [get_ports {a[6]}] [get_ports {a[5]}] [get_ports {a[4]}] [get_ports {a[3]}] [get_ports {a[2]}] [get_ports {a[1]}] [get_ports {a[0]}] [get_ports {b[7]}] [get_ports {b[6]}] [get_ports {b[5]}] [get_ports {b[4]}] [get_ports {b[3]}] [get_ports {b[2]}] [get_ports {b[1]}] [get_ports {b[0]}] [get_ports reset] [get_ports start]]
group_path -name REGOUT  -to [list [get_ports {z[7]}] [get_ports {z[6]}] [get_ports {z[5]}] [get_ports {z[4]}] [get_ports {z[3]}] [get_ports {z[2]}] [get_ports {z[1]}] [get_ports {z[0]}] [get_ports done]]
set_input_delay -clock clock  1.2  [get_ports clock]
Warning: Setting input delay on clock port (clock) relative to a clock (clock) defined at the same port. Command is ignored. (UITE-489)
set_input_delay -clock clock  1.2  [get_ports {a[7]}]
set_input_delay -clock clock  1.2  [get_ports {a[6]}]
set_input_delay -clock clock  1.2  [get_ports {a[5]}]
set_input_delay -clock clock  1.2  [get_ports {a[4]}]
set_input_delay -clock clock  1.2  [get_ports {a[3]}]
set_input_delay -clock clock  1.2  [get_ports {a[2]}]
set_input_delay -clock clock  1.2  [get_ports {a[1]}]
set_input_delay -clock clock  1.2  [get_ports {a[0]}]
set_input_delay -clock clock  1.2  [get_ports {b[7]}]
set_input_delay -clock clock  1.2  [get_ports {b[6]}]
set_input_delay -clock clock  1.2  [get_ports {b[5]}]
set_input_delay -clock clock  1.2  [get_ports {b[4]}]
set_input_delay -clock clock  1.2  [get_ports {b[3]}]
set_input_delay -clock clock  1.2  [get_ports {b[2]}]
set_input_delay -clock clock  1.2  [get_ports {b[1]}]
set_input_delay -clock clock  1.2  [get_ports {b[0]}]
set_input_delay -clock clock  1.2  [get_ports reset]
set_input_delay -clock clock  1.2  [get_ports start]
set_output_delay -clock clock  1.2  [get_ports {z[7]}]
set_output_delay -clock clock  1.2  [get_ports {z[6]}]
set_output_delay -clock clock  1.2  [get_ports {z[5]}]
set_output_delay -clock clock  1.2  [get_ports {z[4]}]
set_output_delay -clock clock  1.2  [get_ports {z[3]}]
set_output_delay -clock clock  1.2  [get_ports {z[2]}]
set_output_delay -clock clock  1.2  [get_ports {z[1]}]
set_output_delay -clock clock  1.2  [get_ports {z[0]}]
set_output_delay -clock clock  1.2  [get_ports done]
1
Information: Defining new variable 'constraint_file'. (CMD-041)
pt_shell> 
pt_shell> ##################################################################
pt_shell> #    Update_timing and check_timing Section                      #
pt_shell> ##################################################################
pt_shell> 
pt_shell> update_timing -full
Warning: Zero transition time will be used at to pins of annotated arcs. Delays on not annotated delay arcs will be estimated using best available slew.  (PTE-066)
Warning: Some timing arcs have been disabled for breaking timing loops or because of constant propagation. Use the 'report_disable_timing' command to get the list of these disabled timing arcs. (PTE-003)
Information: Zero transition time used at to pin of annotated arcs. Delays on not annotated delay arcs will be estimated using best available slew.  (PTE-054)
Information: Zero transition time used at to pin of annotated arcs. Delays on not annotated delay arcs will be estimated using best available slew.  (PTE-054)
1
pt_shell> check_timing -verbose > $REPORTS_DIR/${DESIGN_NAME}_check_timing.report
pt_shell> 
pt_shell> 
pt_shell> ##################################################################
pt_shell> #    Report_timing Section                                       #
pt_shell> ##################################################################
pt_shell> report_global_timing > $REPORTS_DIR/${DESIGN_NAME}_report_global_timing.report
pt_shell> report_clock -skew -attribute > $REPORTS_DIR/${DESIGN_NAME}_report_clock.report 
pt_shell> report_analysis_coverage > $REPORTS_DIR/${DESIGN_NAME}_report_analysis_coverage.report
pt_shell> report_timing -slack_lesser_than 0.0 -delay min_max -nosplit -input -net  > $REPORTS_DIR/${DESIGN_NAME}_report_timing.re port
pt_shell> 
pt_shell> 
pt_shell> ##################################################################  
pt_shell> #    Power Switching Activity Annotation Section                 #  
pt_shell> ##################################################################  
pt_shell> read_vcd $ACTIVITY_FILE -strip_path $STRIP_PATH         
Information: Checked out license 'PrimeTime-PX' (PT-019)
Error: Cannot open "/home/userdata/ncs/hiepdm/00-projects/montgomery_multiplier/sim/montgomery_multiplier.saif".  (PWR-123)
Error: 0
	Use error_info for more info. (CMD-013)
pt_shell> report_switching_activity -list_not_annotated           
Error: In the \fBtime_based\fP power analysis mode, activity reporting may not be available prior to \fBupdate_power\fP (UIPWR-206)
0
pt_shell> 
pt_shell> ##################################################################
pt_shell> #    Power Analysis Section                                      #
pt_shell> ##################################################################
pt_shell> 
pt_shell> ## set power analysis options                                   
pt_shell> set_power_analysis_options -waveform_format fsdb -waveform_output $REPORTS_DIR/${DESIGN_NAME}
pt_shell> 
pt_shell> ## run power analysis
pt_shell> check_power   > $REPORTS_DIR/${DESIGN_NAME}_check_power.report
pt_shell> update_power  
Error: Event file (VCD or its equivalent) was not properly set for time based power analysis. (PWR-006)
0
pt_shell> 
pt_shell> ## report_power
pt_shell> report_power > $REPORTS_DIR/${DESIGN_NAME}_report_power.report
pt_shell> 
pt_shell> 
pt_shell> # Clock Gating & Vth Group Reporting Section
pt_shell> report_clock_gate_savings  
Error: Event file (VCD or its equivalent) was not properly set for time based power analysis. (PWR-006)
Error: Could not run command because power is not up-to-date (PWR-944)
0
pt_shell> 
pt_shell> # Set Vth attribute for each library if not set already
pt_shell> foreach_in_collection l [get_libs] {
? [K[11G?         if {[get_attribute [get_lib $l] default_threshold_voltage_group] == ""} {
? [K[11G?                 set lname [get_object_name [get_lib $l]]
? [K[11G?                 set_user_attribute [get_lib $l] default_threshold_voltage_group $lname -class lib
? [K[11G?         }
? [K[11G? }
Warning: Attribute 'default_threshold_voltage_group' does not exist on lib 'NangateOpenCellLibrary' (ATTR-3)
Set attribute 'default_threshold_voltage_group' on 'NangateOpenCellLibrary'
Information: Defining new variable 'lname'. (CMD-041)
Information: Defining new variable 'l'. (CMD-041)
pt_shell> report_power -threshold_voltage_group > $REPORTS_DIR/${DESIGN_NAME}_pwr.per_lib_leakage
pt_shell> report_threshold_voltage_group > $REPORTS_DIR/${DESIGN_NAME}_pwr.per_volt_threshold_group
pt_shell> exit

Timing updates: 1 (0 implicit, 1 explicit) (0 incremental, 1 full, 0 logical)
Noise updates: 0 (0 implicit, 0 explicit) (0 incremental, 0 full)
Maximum memory usage for this session: 791.64 MB
CPU usage for this session: 3 seconds 
Elapsed time for this session: 439 seconds
Diagnostics summary: 13 errors, 4 warnings, 67 informationals

Thank you for using pt_shell!
